/*
Напиши программу, которая в методе main объявляет такие переменные:
name типа String, age типа int и city типа String.
Примечание: "объявить переменную" - значит то же, что и "создать переменную".
Требования:
•
Объяви переменную name типа String.
•
Объяви переменную age типа int.
•
Объяви переменную city типа String.
•
Должны быть объявлены 3 переменные.
*/

public class Task_1_1 {
    public static void main(String[] args) {
//Объяляем переменную name типа String.
        String name;
//Объяляем переменную age типа int.
        int age;
//Объяляем переменную city типа String.
        String city;
//Задаём значение переменным
        name = "Олег";
        age = 45;
        city = "Москва";
    }
}
